
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьНайтиВалюту(Код, СимвольныйКод, ПредставлениеВалюты) Экспорт
	
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(Код);
	
	Если СсылкаНаВалюту.Пустая() Тогда
		НовыйОбъект = Справочники.Валюты.СоздатьЭлемент();
		НовыйОбъект.Код = Код;
		НовыйОбъект.Наименование = СимвольныйКод;
		НовыйОбъект.ПолноеНаименование = ПредставлениеВалюты;
		НовыйОбъект.Использовать = Истина;
		
		НовыйОбъект.Записать(); // СИНХРОННАЯ запись
		СсылкаНаВалюту = НовыйОбъект.Ссылка;
		
		Сообщить("Валюта '" + ПредставлениеВалюты + "' успешно добавлена в справочник.");
		
	КонецЕсли;
	
	Возврат СсылкаНаВалюту;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
