
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

// Записать курс валюты.
// 
// Параметры:
//  ДатаКурса Дата курса
//  Валюта Валюта
//  Курс Курс
//  Кратность Кратность
Процедура ЗаписатьКурсВалюты(ДатаКурса, Валюта, Курс, Кратность) Экспорт
	
	Попытка
			
		Запись = СоздатьМенеджерЗаписи();
		Запись.Валюта		= Валюта;
		Запись.Период = ДатаКурса;
		Запись.Курс = Курс;
		Запись.Кратность = Кратность;
		Запись.Записать();
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать курс валюты " + Валюта + " на дату " + ДатаКурса + " по причине: " + ОписаниеОшибки();
	КонецПопытки;

	
КонецПроцедуры

// Записать таблицу курсов.
// 
// Параметры:
//  ТаблицаКурсов - таблица значений с колонками: Период, Валюта, Цена, Кратность
Процедура ЗаписатьТаблицуКурсов(Знач ТаблицаКурсов) Экспорт
	
	Для Каждого СтрокаКурса Из ТаблицаКурсов Цикл
		ЗаписатьКурсВалюты(СтрокаКурса.Период, СтрокаКурса.Валюта, СтрокаКурса.Цена, СтрокаКурса.Кратность);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
