
#Область ПрограммныйИнтерфейс

// Функция - Сообщить пользователю
// 
// Параметры:
//  ТекстСообщения	 - Строка - Текст сообщения
//  КлючДанных		 - Произвольный - Ключ данных
//  Поле			 - Строка - Поле
//  ПутьКДанным		 - Строка - Путь к данным
//  Отказ			 - Булево - Отказ
//
Процедура СообщитьПользователю(Знач ТекстСообщения, Знач КлючДанных = Неопределено, Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Если ТипЗнч(ТекстСообщения) = Тип("Строка") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = Поле;
		Сообщение.ПутьКДанным = ПутьКДанным;
		Сообщение.КлючДанных = КлючДанных;
		Сообщение.Сообщить();
	Иначе
		ТекстСообщения.Сообщить();
	КонецЕсли;

	Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
