
#Область ПрограммныйИнтерфейс

// Выводит сообщение об ошибке в информационную панель.
//
// Параметры:
//  Заголовок - Строка - заголовок сообщения об ошибке.
//  ИнформацияОбОшибке - ИнформацияОбОшибке - информация об ошибке.
//  ГруппаОшибокДляЖурнала - Строка - группа ошибок для записи в журнал регистрации.
//  ТолькоКратко - Булево - если Истина, то выводится только краткое описание ошибки.
//
Процедура СообщитьОписаниеОшибки(Заголовок = "", ИнформацияОбОшибке, ГруппаОшибокДляЖурнала = "", ТолькоКратко = Истина) Экспорт

    //для пользователя (любой клиент)
    Если ТолькоКратко Тогда
        СтрокаСОписанием = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
    Иначе
        СтрокаСОписанием = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
    КонецЕсли;
    Если Заголовок <> "" Тогда
     	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Заголовок);
    	Заголовок = "";
    КонецЕсли;
    
    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСОписанием);
    
    Если ЗначениеЗАполнено(ГруппаОшибокДляЖурнала) тогда
    	ОбработкаОшибокСерверВызовСервера.ЗаписатьИнформациюОбОшибкеВЖурнал(ГруппаОшибокДляЖурнала, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), Ложь);
    КонецЕсли;
	
КонецПроцедуры

// Выводит сообщение об ошибке в информационную панель.
//
// Параметры:
//  Заголовок - Строка - заголовок сообщения об ошибке.
//  ТекстОшибки - Строка - текст сообщения об ошибке.
//  ГруппаОшибокДляЖурнала - Строка - группа ошибок для журнала регистрации.
//
Процедура СообщитьОбОшибке(Заголовок = "", ТекстОшибки, ГруппаОшибокДляЖурнала = "") Экспорт

    Если Заголовок <> "" Тогда
     	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Заголовок);
    	Заголовок = "";
    КонецЕсли;
    
    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
    
    Если ЗначениеЗАполнено(ГруппаОшибокДляЖурнала) тогда
    	ОбработкаОшибокСерверВызовСервера.ЗаписатьОшибкуВЖурнал(ГруппаОшибокДляЖурнала, ТекстОшибки, Ложь);
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
