
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВалютуИзКлассификатора(Команда)
	
	ПослеВыбораВалюты = Новый ОписаниеОповещения("ОбработатьВыборВалюты", ЭтотОбъект);
	ОткрытьФорму("Справочник.Валюты.Форма.ВыборИзКлассификатора", , ЭтотОбъект, , , , ПослеВыбораВалюты);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)
	
	//открыть форму выбора периода
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Диалог.Период.ДатаОкончания = ТекущаяДата();
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьКурсыЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборВалюты(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаВалюту = СоздатьНайтиВалюту(ВыбранноеЗначение);
	
	Если СсылкаНаВалюту <> Неопределено Тогда
		ОткрытьФорму(
			"Справочник.Валюты.ФормаОбъекта", 
			Новый Структура("Ключ", СсылкаНаВалюту), 
			ЭтотОбъект, 
			УникальныйИдентификатор 
		);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьНайтиВалюту(РеквизитыВалюты)
	Возврат  Справочники.Валюты.СоздатьНайтиВалюту(РеквизитыВалюты.КодВалюты, РеквизитыВалюты.СимвольныйКод, РеквизитыВалюты.ПолноеНаименование)
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКурсыЗавершение(Период, ДополнительныеПараметры) Экспорт
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗагрузитьКурсыНаСервере(Период.ДатаНачала, Период.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыНаСервере(ДатаНачала, ДатаОкончания)
	
	МодульРаботыСВалютами = ПодключаемыеМодулиСервер.МодульРаботыСВалютами();
	МодульРаботыСВалютами.ЗагрузитьВсеКурсыВалют(ДатаНачала, ДатаОкончания);
	
КонецПроцедуры


#КонецОбласти

