
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенные() Экспорт
	
	ЭлементETF = Справочники.ВидыАктивов.ETF.ПолучитьОбъект();
	ЭлементETF.БлокMOEX = "stock";
	ЭлементETF.РынокMOEX = "etf";
	ЭлементETF.Записать();

	ЭлементАкция = Справочники.ВидыАктивов.Акция.ПолучитьОбъект();
	ЭлементАкция.БлокMOEX = "stock";
	ЭлементАкция.РынокMOEX = "shares";
	ЭлементАкция.Записать();
	
	ЭлементФьючерс = Справочники.ВидыАктивов.Фьючерс.ПолучитьОбъект();
	ЭлементФьючерс.БлокMOEX = "futures";
	ЭлементФьючерс.РынокMOEX = "futures";
	ЭлементФьючерс.Записать();
	
	ЭлементОблигация = Справочники.ВидыАктивов.Облигация.ПолучитьОбъект();
	ЭлементОблигация.БлокMOEX = "bond";
	ЭлементОблигация.РынокMOEX = "bonds";
	ЭлементОблигация.Записать();
	
	ЭлементВалюта = Справочники.ВидыАктивов.Валюта.ПолучитьОбъект();
	ЭлементВалюта.БлокMOEX = "currency";
	ЭлементВалюта.РынокMOEX = "currencies";
	ЭлементВалюта.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
