
#Область ПрограммныйИнтерфейс

Функция МодульРаботыСВалютами() Экспорт
	
	МодульРаботыСВалютами = Неопределено;
	ИмяМодуляРаботыСВалютами = Константы.МодульДляРаботыСВалютами.Получить();
	Если НЕ ЗначениеЗАполнено(ИмяМодуляРаботыСВалютами) = "" Тогда
		ВызватьИсключение "Не указан модуль для работы с валютами";
	КонецЕсли;
	
	МодульРаботыСВалютами = Обработки[ИмяМодуляРаботыСВалютами].Создать();
	Возврат МодульРаботыСВалютами;
	
КонецФункции

// Возвращает модуль для работы с активами
//
// Возвращаемое значение:
//  ОбработкаОбъект.<ИмяМодуляРаботыСВалютами> - модуль для работы с валютами
//
//
Функция МодульРаботыСАктивами() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МодульРаботыСАктивами = Неопределено;
	ИмяМодуляРаботыСАктивами= Константы.МодульДляРаботыСАктивами.Получить();
	Если НЕ ЗначениеЗАполнено(ИмяМодуляРаботыСАктивами) Тогда
		ВызватьИсключение "Не указан модуль для работы с активами";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МодульРаботыСАктивами = Обработки[ИмяМодуляРаботыСАктивами].Создать();
	Возврат МодульРаботыСАктивами;
	
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
