
#Область ПрограммныйИнтерфейс

Функция МодульРаботыСВалютами() Экспорт
	
	МодульРаботыСВалютами = Неопределено;
	ИмяМодуляРаботыСВалютами = Константы.МодульДляРаботыСВалютами.Получить();
	Если МодульРаботыСВалютами = "" Тогда
		ВызватьИсключение "Не указан модуль для работы с валютами";
	КонецЕсли;
	
	МодульРаботыСВалютами = Обработки[ИмяМодуляРаботыСВалютами].Создать();
	Возврат МодульРаботыСВалютами;
	
КонецФункции

Функция МодульРаботыСАктивами() Экспорт
	
	МодульРаботыСВалютами = Неопределено;
	ИмяМодуляРаботыСВалютами = Константы.МодульДляРаботыСАктивами.Получить();
	Если МодульРаботыСВалютами = "" Тогда
		ВызватьИсключение "Не указан модуль для работы с активами";
	КонецЕсли;
	
	МодульРаботыСВалютами = Обработки[ИмяМодуляРаботыСВалютами].Создать();
	Возврат МодульРаботыСВалютами;
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
