//*************
//Модуль обработки должен содержать Функции:
//	1  Функция ОписаниеМодуля() - возвращает структуру с описанием модуля 
//	2. Функция ПолучитьСписокВсехАктивов() - получает список активов с ресурса
//  3. Функция ПолучитьПодробнуюИнформациюПоАктиву(Актив) - получает подробную информацию по активу
//  4. Функция ПолучитьГрафикЦенПоАктиву(Актив, НачалоПериода, КонецПериода, ТаймФрейм) - загружает график цен по активу за выбранный период
//	5. Функция ПолучитьСтаканПоАктиву(Актив) - получает стакан по активу
//
//*************

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ОписаниеМодуля() Экспорт
	
	ОписаниеМодуля = Новый Структура;
	ОписаниеМодуля.Вставить("Версия", "1.0");
	ОписаниеМодуля.Вставить("Заголовок", НСтр("ru = 'Загрузка активов из спискаи и цен  с сайта MOEX'"));
	ОписаниеМодуля.Вставить("Описание", НСтр("ru = 'Загружает список активов с сайта MOEX и цены по активам за выбранный период с сайта MOEX'"));
	ОписаниеМодуля.Вставить("ВидОбработки", "ДополнительныеМодуль");
	ОписаниеМодуля.Вставить("ТипМодуля", "РаботаСАктивами");
	
	Возврат ОписаниеМодуля;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
