
#Область ПрограммныйИнтерфейс

// Выводит сообщение об ошибке в информационную панель.
//
// Параметры:
//  ИнформацияОбОшибке - структура содержащая информацию об ошибке.
//

Процедура СообщитьОписаниеОшибки(Заголовок = "", ИнформацияОбОшибке, ГруппаОшибокДляЖурнала = "", ТолькоКратко = Истина) Экспорт

    //для пользователя (любой клиент)
    Если ТолькоКратко Тогда
        СтрокаСОписанием = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
    Иначе
        СтрокаСОписанием = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
    КонецЕсли;
    Если Заголовок <> "" Тогда
     	Сообщить(Заголовок);
    	Заголовок = "";
    КонецЕсли;
    
    Сообщить(СтрокаСОписанием);
    
    Если ЗначениеЗАполнено(ГруппаОшибокДляЖурнала) тогда
    	ОбработкаОшибокСерверВызовСервера.ЗаписатьИнформациюОбОшибкеВЖурнал(ГруппаОшибокДляЖурнала, СтрокаСОписанием, Ложь);
    КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОбОшибке(Заголовок = "", ИнформацияОбОшибке, ГруппаОшибокДляЖурнала = "") Экспорт

    Если Заголовок <> "" Тогда
     	Сообщить(Заголовок);
    	Заголовок = "";
    КонецЕсли;
    
    Сообщить(ИнформацияОбОшибке);
    
    Если ЗначениеЗАполнено(ГруппаОшибокДляЖурнала) тогда
    	ОбработкаОшибокСерверВызовСервера.ЗаписатьОшибкуВЖурнал(ГруппаОшибокДляЖурнала, ИнформацияОбОшибке, Ложь);
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
