
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВалют = ПолучитьСписокВалютИзКлассификатораНаСервере();
	Для каждого СписокВалютЭлемент Из СписокВалют Цикл
		НоваяСтрока = СписокВыборкиВалюты.Добавить();
		НоваяСтрока.КодВалюты = СписокВалютЭлемент.Значение.ЦифровойКод;
		НоваяСтрока.СимвольныйКод = СписокВалютЭлемент.Значение.СимвольныйКод;
		НоваяСтрока.ПолноеНаименование = СписокВалютЭлемент.Представление;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ТекущаяСтрока = Элементы.СписокВыборкиВалюты.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите валюту из списка'"));
		Возврат;
	Иначе
		Закрыть(Новый Структура("КодВалюты, СимвольныйКод, ПолноеНаименование", ТекущаяСтрока.КодВалюты, ТекущаяСтрока.СимвольныйКод, ТекущаяСтрока.ПолноеНаименование));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Синхронная функция для получения данных с сайта
&НаСервереБезКонтекста
Функция ПолучитьСписокВалютИзКлассификатораНаСервере()
	
	СписокДляВыбора = Новый СписокЗначений;
	
	МодульРаботыСВалютами = ПодключаемыеМодулиСервер.МодульРаботыСВалютами();
	МодульРаботыСВалютами.ПолучитьСписокВалютИзКлассификатора();
	
	Возврат СписокДляВыбора;
	
КонецФункции

#КонецОбласти
