
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьСправочник(Команда)
	
	ПараметрыОткрытия = новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина);
	//@skip-check notify-description-to-server-procedure
	ПослеВыбора = новый ОписаниеОповещения("ПослеВыбораВидаАктива", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыАктивов.ФормаВыбора",ПараметрыОткрытия,,,,,ПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПослеВыбораВидаАктива(МассивВидовАктивов, ДополнительныеПараметры) Экспорт 

	Если МассивВидовАктивов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если МассивВидовАктивов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьАктивыНаСервере(МассивВидовАктивов);
	
КонецПроцедуры

Процедура ЗагрузитьАктивыНаСервере(МассивВидовАктивов)
	
	МодульРаботыСВалютами = ПодключаемыеМодулиСервер.МодульРаботыСАктивами();
	МассивАктивов = МодульРаботыСВалютами.СписокАктивовПоВсемВидам(МассивВидовАктивов);
	
КонецПроцедуры

#КонецОбласти
