
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьСправочник(Команда)
	
	ПараметрыОткрытия = новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина);
	//@skip-check notify-description-to-server-procedure
	ПослеВыбора = новый ОписаниеОповещения("ПослеВыбораВидаАктива", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыАктивов.ФормаВыбора",ПараметрыОткрытия,,,,,ПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПослеВыбораВидаАктива(МассивВидовАктивов, ДополнительныеПараметры) Экспорт 

	Если МассивВидовАктивов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если МассивВидовАктивов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьАктивыНаСервере(МассивВидовАктивов);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАктивыНаСервере(МассивВидовАктивов)
	
	МодульРаботыСВалютами = ПодключаемыеМодулиСервер.МодульРаботыСАктивами();
	МассивАктивов = МодульРаботыСВалютами.СписокАктивовПоВыбраннымВидам(МассивВидовАктивов);
	
	Для каждого СтрокаАктива Из МассивАктивов Цикл
		
		Сообщить(СтрШаблон("Наименование %1, ISIN %2, Дата погашения %3, Торгуется %4, Сектор экономики %5, Тикер %6", СтрокаАктива.Наименование, СтрокаАктива.ISIN, СтрокаАктива.ДатаПогашения, СтрокаАктива.Торгуется, СтрокаАктива.СекторЭкономики, СтрокаАктива.Тикер));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
