
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИнформациюОбОшибкеВЖурнал(ГруппаОшибок, ИнформацияОбОшибке, Кратко = Ложь) Экспорт
	
	ТекстОшибки = "";
    Если Кратко тогда
    	ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
    Иначе
    	ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
    КонецЕсли;
    ЗаписьЖурналаРегистрации(ГруппаОшибок, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурнал(ГруппаОшибок, ТекстОшибки) Экспорт
	
    ЗаписьЖурналаРегистрации(ГруппаОшибок, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
