
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИнформациюОбОшибкеВЖурнал(ГруппаОшибок, ИнформацияОбОшибке, Кратко = Ложь) Экспорт
	
	ТекстОшибки = "";
    Если Кратко тогда
    	ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
    Иначе
    	ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
    КонецЕсли;
    ЗаписьЖурналаРегистрации(ГруппаОшибок, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурнал(ГруппаОшибок, ТекстОшибки, Метаданные = Неопределено, Объект = Неопределено) Экспорт
	
    ЗаписьЖурналаРегистрации(ГруппаОшибок, УровеньЖурналаРегистрации.Ошибка, Метаданные, Объект, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
